import pyxel
from enum import Enum, auto

#ゲーム全般
残り時間 = 1 * 5 #分×秒 10 * 60
CELL = 8 #最小の枠
TILE = CELL * 2 #タイルのサイズ
FIELD = TILE * 16 #画面にうつる枠
WORLD_MAP = FIELD * 8 #ワールドマップのサイズ(全タイル)

G_WIDTH = WORLD_MAP
G_HEIGHT = WORLD_MAP
L_WIDTH = FIELD
L_HEIGHT = FIELD
TITLE = "きあらちゃんをさがせ！"

#BGM系
BGMチャンネル = 2
アタリ音 = 57
ハズレ音 = 58
メニュー音=61
メッセージ音=63
階段音=60
アイテム取得=59
BGM = {
    0: ("しゅきぴ",[26,27]),
    1: ("超特急逃走中",[28]),
    2: ("仲直りシュークリーム",[29]),
    3: ("とくべチュして",[30,31]),
    4: ("ナツマトペ",[32]),
    5: ("夏祭り恋慕う",[33,34]),
    6: ("ウィークエンドシトロン",[35]),
    7: ("お姫様にしてよ",[37,38,39]),
    8: ("あの子コンプレックス",[40,41,42]),
    9: ("僕らの制服クリスマス",[43,44]),
    10: ("虹の素",[46]),
    11: ("海とレモンティー",[47,48]),
    12: ("呪って呪って",[48]),
    13: ("絶対アイドル辞めないで",[54,55]),
}

#オープニング
GAME_TITLE_POS_Y = 50
class OPENING_MODE(Enum):
    OPENING = auto()
    MENU = auto()
整列先頭 = (35*TILE,39*TILE) 
#フォント系
TITLE_FONT_SIZE = 12
FONT_SIZE = 8
メニュー縦幅 = 12 #フォントは8で上下2のパディングがある

#物語列挙型
class STORY(Enum):
    TITLE = 0
    BGM = 1
    OPENING = 2
    PLAY = 3
    BOOK = 4
    QUIZ = 5
    ENDING = 6
    GAMECLEAR = 7

#色列挙型
class 色(Enum):
    BLACK = 0
    DEEP_BLUE = 1
    DEEP_PURPLE = 2
    DEEP_GREEN = 3
    BROWN = 4
    DARK_BLUE = 5
    LIGHT_BLUE = 6
    WHITE = 7
    RED = 8
    ORANGE = 9
    YELLOW = 10
    LIGHT_GREEN = 11
    BLUE = 12
    GRAY = 13
    PINK = 14
    SKIN = 15

#タイマー表示
T_WIDTH = 40
T_HEIGHT = 12
T_POS_X = 8
T_POS_Y = 10
T_PADDING = 2

#部屋系
部屋 ={
    #部屋の名前: (タイル座標X開始,タイル座標X終了), (タイル座標Y開始,タイル座標Y終了)
    '楽屋': [(0,TILE*15),(0,TILE*15)],
    '楽屋／ダンス室': [(TILE*16,TILE*31),(0,TILE*15)],
    'ダンス室': [(TILE*32,TILE*62),(0,TILE*15)],

    'けーたりんぐ': [(0,TILE*15),(TILE*16,TILE*31)],
    'けーたりんぐ／裏すて': [(TILE*16,TILE*31),(TILE*16,TILE*31)],
    '表すて／裏すて': [(TILE*32,TILE*47),(TILE*16,TILE*31)],
    '裏すて／ほーるわき': [(TILE*48,TILE*63),(TILE*16,TILE*31)],
    
    '入場口／物販': [(0,TILE*15),(TILE*32,TILE*47)],
    '入場口／ほーる': [(TILE*16,TILE*31),(TILE*32,TILE*47)],
    'ほーる': [(TILE*32,TILE*47),(TILE*32,TILE*47)],
    'ほーるわき／駐車場': [(TILE*47,TILE*63),(TILE*32,TILE*47)],
    
    '物販／外': [(0,TILE*15),(TILE*48,TILE*63)],
    'CD宝釣り／外': [(TILE*16,TILE*31),(TILE*48,TILE*63)],
    '入場口／ほーる': [(TILE*32,TILE*47),(TILE*48,TILE*63)],
    '入場口／駐車場': [(TILE*48,TILE*63),(TILE*48,TILE*63)],

    '隠し部屋':[(TILE*16,TILE*64),(TILE*32,TILE*80)],
}
最後の部屋=(1,4)

#部屋名表示
部屋名の文字数最長=12
R_WIDTH=部屋名の文字数最長*FONT_SIZE
R_HEIGHT = 12
R_POS_x=T_POS_X + T_WIDTH
R_POS_y=T_POS_Y

#BGM表示
曲名の文字数最長=13
B_WIDTH = 曲名の文字数最長*FONT_SIZE
B_HEIGHT = 12
B_POS_X = R_POS_x + R_WIDTH
B_POS_Y = T_POS_Y

#アイテム系
class アイテム(Enum):
    とちぎのいちご = "とちぎのいちご"
    さいりうむ = "さいりうむ"
    めがほん = "めがほん"

#アイテム表示
アイテム名の文字数最長=6
I_WIDTH =  T_WIDTH + R_WIDTH + B_WIDTH
I_HEIGHT = T_HEIGHT
I_POS_X = T_POS_X
I_POS_Y = T_POS_Y + T_HEIGHT

#キャラクター系
キャラサイズ = 16
キャラ歩幅 = 4
# キャラマージン = 2
当たり判定マージン = 4 #ChatGPTのアドバイス、本当に近づいたときだけ当たり判定が発生するようにする
HOLD = 1
REPEAT = 1
# 舞香ちゃんが最初にいる場所 = [G_WIDTH/2 - L_WIDTH/2, G_HEIGHT/2 - L_HEIGHT/2, L_WIDTH/2 - キャラサイズ/2 ,L_HEIGHT/2 - キャラサイズ/2 ]
舞香ちゃんが最初にいる場所 = (2*TILE,2*TILE)
class 舞香ちゃん情報キー(Enum):
    会話済メンバー数 = "会話済メンバー数"
全体X座標 = 0 #タプルのindex
全体Y座標 = 1 #同上
局所X座標 = 2 #同上
局所Y座標 = 3 #同上
class 向き(Enum):
    北 = '北'
    東 = '東'
    西 = '西'
    南 = '南'
class 状態(Enum):
    歩く = "歩く"
    立ち止まる = "立ち止まる"
    話す = "話す"
    思う = "思う"
    マップ切り替え = "マップ切り替え"
    アイテム拾った = "アイテム拾った"
動作_状態_処理 = 0
動作_状態_描画 = 1
キャラ = {
    'まいか': {
        '右': { 向き.北: [48,0], 向き.東: [16,0], 向き.西: [32,0], 向き.南: [0,0] },
        '左': { 向き.北: [48,16], 向き.東: [16,16], 向き.西: [32,16], 向き.南: [0,16] }
    },
    'みりにゃ': {
        '右': { 向き.北: [48,32], 向き.東: [16,32], 向き.西: [32,32], 向き.南: [0,32] },
        '左': { 向き.北: [48,48], 向き.東: [16,48], 向き.西: [32,48], 向き.南: [0,48] }
    },
    'はなちゃん': {
        '右': { 向き.北: [48,64], 向き.東: [16,64], 向き.西: [32,64], 向き.南: [0,64] },
        '左': { 向き.北: [48,80], 向き.東: [16,80], 向き.西: [32,80], 向き.南: [0,80] }
    },
    'きあら': {
        '右': { 向き.北: [128,64], 向き.東: [96,64], 向き.西: [112,64], 向き.南: [80,64] },
        '左': { 向き.北: [128,80], 向き.東: [96,80], 向き.西: [112,80], 向き.南: [80,80] }
    },
    'りさ': {
        '右': { 向き.北: [48,96], 向き.東: [16,96], 向き.西: [32,96], 向き.南: [0,96] },
        '左': { 向き.北: [48,112], 向き.東: [16,112], 向き.西: [32,112], 向き.南: [0,112] }
    },
    'ひとみ': {
        '右': { 向き.北: [48,128], 向き.東: [16,128], 向き.西: [32,128], 向き.南: [0,128] },
        '左': { 向き.北: [48,144], 向き.東: [16,144], 向き.西: [32,144], 向き.南: [0,144] }
    },
    'しょこ': {
        '右': { 向き.北: [48,160], 向き.東: [16,160], 向き.西: [32,160], 向き.南: [0,160] },
        '左': { 向き.北: [48,176], 向き.東: [16,176], 向き.西: [32,176], 向き.南: [0,176] }
    },
    'いおり': {
        '右': { 向き.北: [48,192], 向き.東: [16,192], 向き.西: [32,192], 向き.南: [0,192] },
        '左': { 向き.北: [48,208], 向き.東: [16,208], 向き.西: [32,208], 向き.南: [0,208] }
    },
    'さなつん': {
        '右': { 向き.北: [48,224], 向き.東: [16,224], 向き.西: [32,224], 向き.南: [0,224] },
        '左': { 向き.北: [48,240], 向き.東: [16,240], 向き.西: [32,240], 向き.南: [0,240] }
    },
    'あんな': {
        '右': { 向き.北: [128,0], 向き.東: [96,0], 向き.西: [112,0], 向き.南: [80,0] },
        '左': { 向き.北: [128,16], 向き.東: [96,16], 向き.西: [112,16], 向き.南: [80,16] }
    },
    'さっしー': {
        '右': { 向き.北: [128,32], 向き.東: [96,32], 向き.西: [112,32], 向き.南: [80,32] },
        '左': { 向き.北: [128,48], 向き.東: [96,48], 向き.西: [112,48], 向き.南: [80,48] }
    },
    'いなちゃん' : {
        '右': { 向き.北: [128,112], 向き.東: [96,112], 向き.西: [112,112], 向き.南: [80,112] },
        '左': { 向き.北: [128,128], 向き.東: [96,128], 向き.西: [112,128], 向き.南: [80,128] }
    },
    'ゆずにい' : {
        '右': { 向き.北: [128,144], 向き.東: [96,144], 向き.西: [112,144], 向き.南: [80,144] },
        '左': { 向き.北: [128,160], 向き.東: [96,160], 向き.西: [112,160], 向き.南: [80,160] }
    },
    'しのぶさん' : {
        '右': { 向き.北: [128,176], 向き.東: [96,176], 向き.西: [112,176], 向き.南: [80,176] },
        '左': { 向き.北: [128,192], 向き.東: [96,192], 向き.西: [112,192], 向き.南: [80,192] }
    },
    'はせがわさん': {
        '右': { 向き.北: [208,0], 向き.東: [176,0], 向き.西: [192,0], 向き.南: [160,0] },
        '左': { 向き.北: [208,16], 向き.東: [176,16], 向き.西: [192,16], 向き.南: [160,16] }
    },
    'じろうさん': {
        '右': { 向き.北: [208,32], 向き.東: [176,32], 向き.西: [192,32], 向き.南: [160,32] },
        '左': { 向き.北: [208,48], 向き.東: [176,48], 向き.西: [192,48], 向き.南: [160,48] }
    },
    'とくべちゅきあら': {
        '右': { 向き.北: [208,208], 向き.東: [96,208], 向き.西: [192,208], 向き.南: [80,208] },
        '左': { 向き.北: [208,224], 向き.東: [96,224], 向き.西: [192,224], 向き.南: [80,224] }
    }
}
寝てるきあら = [(48,140),(49,140),(48,141),(49,141)]
くろしままえ = {(10,72), (11,72), (10,73), (11,73)}

#マップ系
歩けるタイル = {
    #部屋・廊下
    (0,0),(1,0),(0,1),(1,1), (2,0),(3,0),(2,1),(3,1), (4,0),(5,0),(4,1),(5,1), (6,0),(7,0),(6,1),(7,1), (8,0),(9,0),(8,1),(9,1), (10,0),(11,0),(10,1),(11,1), (12,0),(13,0),(12,1),(13,1), (14,0),(15,0),(14,1),(15,1), 
    (16,0),(17,0),(16,1),(17,1), (20,0),(21,0),(20,1),(21,1), (28,0),(29,0),(28,1),(29,1), (30,0),(31,0),(30,1),(31,1),
    (18,0),(19,0),(18,1),(19,1), (18,2),(19,2),(18,3),(19,3), (18,4),(19,4),(18,5),(19,5), (18,6),(19,6),(18,7),(19,8),
    #草
    (22,0),(23,0),(22,1),(23,1), 
    #アスファルト
    (24,0),(25,0),(24,1),(25,1), (24,2),(25,2),(24,3),(25,3), (24,4),(25,4),(24,5),(25,5), (24,6),(25,6),(24,7),(25,7), 
    #階段
    (0,8),(1,8),(0,9),(1,9), (10,14),(11,14),(10,15),(11,15), (18,2),(19,2),(18,3),(19,3), (30,4),(31,4),(30,5),(31,5),
    #アイテム いちご、拡声器、サイリウム
    (2,22),(3,22),(2,23),(3,23), (22,4),(23,4),(22,5),(23,5), (24,12),(25,12),(24,13),(25,13), 
}
タイル_とちぎのいちごとったあと = [(2, 0), (3, 0), (2, 1), (3, 1)]
タイル_拡声器とったあと = [(22, 0), (23, 0), (22, 1), (23, 1)]
タイル_サイリウムとったあと = [(24, 0), (25, 0), (24, 1), (25, 1)]
タイル_きあらが寝てる床 = [(30, 0), (31, 0), (30, 1), (31, 1)]

#階段
階段_ケータリング = {(10,14),(11,14),(10,15),(11,15)}
階段_衣装部屋 = {(0,8),(1,8),(0,9),(1,9)}
階段_ステージ裏 = {(18,2),(19,2),(18,3),(19,3)}
階段_隠し部屋 = {(30,4),(31,4),(30,5),(31,5)}

階段_X座標Idx = 0
階段_Y座標Idx = 1

階段脇_ケータリング = (TILE*2, TILE*29)
階段脇_衣装部屋 = (TILE*3,FIELD * 4 + TILE*3)
階段脇_ステージ裏 = (TILE*49, TILE*24)
階段脇_隠し部屋 = (TILE*27, FIELD * 4 + TILE*7)

#アイテム
アイテム_とちぎのいちご_識別 = [(2,22),(3,22),(2,23),(3,23)]
アイテム_とちぎのいちご_配置 = [(16,16),(16,17),(17,16),(17,17)]
アイテム_拡声器_識別 = [(22,4),(23,4),(22,5),(23,5)]
アイテム_拡声器_配置 = [(122,122),(122,123),(123,122),(123,123)]
アイテム_サイリウム_識別 = [(24,12),(25,12),(24,13),(25,13)]
アイテム_サイリウム_配置 = [(4,84),(5,84),(4,85),(5,85)]

#メッセージ系
M_GAME_START = "Press Enter Key or A/B Button"
M_SPEED = 2

class M_TYPE(Enum):
    NONE = auto()
    STORY = auto()
    WINDOW = auto()
    WINDOW_AUTO = auto()

M_WINDOW_OUT_MARGIN = 3
M_WINDOW_OUT_POS_X = M_WINDOW_OUT_MARGIN
M_WINDOW_OUT_POS_Y = L_HEIGHT / 4 * 3
M_WINDOW_OUT_WIDTH = L_WIDTH - M_WINDOW_OUT_MARGIN * 2
M_WINDOW_OUT_HEIGHT = L_HEIGHT - M_WINDOW_OUT_POS_Y - M_WINDOW_OUT_MARGIN * 2
M_WINDOW_IN_MARGIN = 3
M_WINDOW_IN_POS_X = M_WINDOW_OUT_POS_X + M_WINDOW_IN_MARGIN
M_WINDOW_IN_POS_Y = M_WINDOW_OUT_POS_Y + M_WINDOW_IN_MARGIN
M_WINDOW_IN_WIDTH = M_WINDOW_OUT_WIDTH - M_WINDOW_IN_MARGIN * 2
M_WINDOW_IN_HEIGHT = M_WINDOW_OUT_HEIGHT - M_WINDOW_IN_MARGIN * 2

#コマンド系
C_WINDOW_CURSOR = '>'
C_WINDOW_PADDING = 5
C_WINDOW_FONT_SIZE = FONT_SIZE + 2
C_WINDOW_POS_X = 20
C_WINDOW_POS_Y = 20
C_WINDOW_CURSOR_X = C_WINDOW_POS_X - FONT_SIZE
C_WINDOW_CURSOR_Y = C_WINDOW_POS_Y

M_STORY_BR = 10

#クイズ問題系
Q_PADDING = 5
Q_POS_X = 20
Q_POS_Y = 20
Q_WIDTH = L_WIDTH - Q_POS_X * 2
Q_HEIGHT = L_HEIGHT / 3

#クイズ回答系
A_PADDING = 10
A_POS_X = Q_POS_X
A_POS_Y = Q_POS_Y + Q_HEIGHT + A_PADDING
A_WIDTH = Q_WIDTH
A_HEIGHT= L_HEIGHT / 2

#デバッグ系
DEBUG = False
START_MODE = STORY.PLAY